{
    "format": "layers-model",
    "generatedBy": "keras v2.9.0",
    "convertedBy": "TensorFlow.js Converter v3.19.0",
    "modelTopology": {
        "keras_version": "2.9.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "model_15",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                9
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_16"
                        },
                        "name": "input_16",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_60",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 90,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_60",
                        "inbound_nodes": [
                            [
                                [
                                    "input_16",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_45",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.99,
                            "epsilon": 1e-05,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_45",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_60",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_45",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "swish"
                        },
                        "name": "activation_45",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_45",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_61",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 90,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_61",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_45",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_46",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.99,
                            "epsilon": 1e-05,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_46",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_61",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_46",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "swish"
                        },
                        "name": "activation_46",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_46",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_62",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 90,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_62",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_46",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_47",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.99,
                            "epsilon": 1e-05,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_47",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_62",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "activation_47",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "swish"
                        },
                        "name": "activation_47",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_47",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_36",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.2,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout_36",
                        "inbound_nodes": [
                            [
                                [
                                    "activation_47",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_63",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_63",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout_36",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_16",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "dense_63",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "mae",
            "metrics": null,
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adagrad",
                "config": {
                    "name": "Adagrad",
                    "learning_rate": 0.9,
                    "decay": 0.0,
                    "initial_accumulator_value": 0.1,
                    "epsilon": 1e-06
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "batch_normalization_45/gamma",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_45/beta",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_45/moving_mean",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_45/moving_variance",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_46/gamma",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_46/beta",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_46/moving_mean",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_46/moving_variance",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_47/gamma",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_47/beta",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_47/moving_mean",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_47/moving_variance",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_60/kernel",
                    "shape": [
                        9,
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_60/bias",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_61/kernel",
                    "shape": [
                        90,
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_61/bias",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_62/kernel",
                    "shape": [
                        90,
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_62/bias",
                    "shape": [
                        90
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_63/kernel",
                    "shape": [
                        90,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_63/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}